[
  {
    "text": "Porque Deus amou o mundo de tal maneira que deu o seu Filho unigênito, para que todo aquele que nele crê não pereça, mas tenha a vida eterna.",
    "reference": "João 3:16",
    "category": "Versículos Bíblicos",
    "subcategory": "Amor de Deus",
    "explanation": "Este é um dos versículos mais conhecidos da Bíblia. Ele revela o amor incondicional de Deus pela humanidade e sua provisão de salvação através de Jesus Cristo. Demonstra que o amor de Deus não é baseado em nossos méritos, mas em sua graça.",
    "tags": "amor, salvação, Jesus, vida eterna, graça",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "Confia no Senhor de todo o teu coração e não te estribes no teu próprio entendimento.",
    "reference": "Provérbios 3:5",
    "category": "Versículos Bíblicos",
    "subcategory": "Confiança",
    "explanation": "Este versículo ensina sobre a importância de confiar em Deus completamente, mesmo quando não entendemos as circunstâncias. Nos lembra que nossa sabedoria é limitada, mas Deus vê o quadro completo.",
    "tags": "confiança, sabedoria, fé, entendimento",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "Posso todas as coisas em Cristo que me fortalece.",
    "reference": "Filipenses 4:13",
    "category": "Versículos Bíblicos",
    "subcategory": "Força e Perseverança",
    "explanation": "Paulo escreveu isso enquanto estava na prisão, mostrando que nossa força não vem de circunstâncias externas, mas da nossa relação com Cristo. Não significa que podemos fazer qualquer coisa, mas que podemos enfrentar qualquer situação com a força de Cristo.",
    "tags": "força, perseverança, Cristo, capacidade",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "Tudo tem o seu tempo determinado, e há tempo para todo o propósito debaixo do céu.",
    "reference": "Eclesiastes 3:1",
    "category": "Versículos Bíblicos",
    "subcategory": "Tempo de Deus",
    "explanation": "Este versículo nos ensina sobre a soberania de Deus sobre o tempo. Cada situação em nossa vida tem seu propósito e momento certo. Isso nos ajuda a ter paciência e aceitar os tempos de Deus.",
    "tags": "tempo, propósito, paciência, soberania",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "Não se turbe o vosso coração; credes em Deus, crede também em mim.",
    "reference": "João 14:1",
    "category": "Versículos Bíblicos",
    "subcategory": "Paz e Tranquilidade",
    "explanation": "Jesus oferece paz em meio às tempestades da vida. Ele nos convida a confiar não apenas em Deus Pai, mas também nele como nosso Salvador. Esta paz vem da certeza de que estamos seguros em suas mãos.",
    "tags": "paz, tranquilidade, confiança, Jesus",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "Bem-aventurados os que choram, porque eles serão consolados.",
    "reference": "Mateus 5:4",
    "category": "Versículos Bíblicos",
    "subcategory": "Consolação",
    "explanation": "Este versículo das bem-aventuranças mostra que Deus não ignora nossa dor. Ele promete consolo para aqueles que enfrentam tristeza e luto. É um lembrete de que nossa dor não é permanente.",
    "tags": "consolação, tristeza, bem-aventuranças, esperança",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "A disciplina é a ponte entre objetivos e conquistas.",
    "reference": "Jim Rohn",
    "category": "Motivação",
    "subcategory": "Autodisciplina",
    "explanation": "A disciplina é o que transforma sonhos em realidade. Ela é a ação consistente que conecta onde estamos com onde queremos estar. Sem disciplina, os objetivos permanecem apenas boas intenções.",
    "tags": "disciplina, objetivos, conquistas, persistência",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "O sucesso não é final, o fracasso não é fatal: é a coragem de continuar que conta.",
    "reference": "Winston Churchill",
    "category": "Motivação",
    "subcategory": "Perseverança",
    "explanation": "Esta frase nos lembra que tanto o sucesso quanto o fracasso são temporários. O que realmente importa é nossa capacidade de continuar tentando, aprendendo e crescendo, independentemente dos resultados.",
    "tags": "sucesso, fracasso, coragem, persistência",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "Você não pode mudar o vento, mas pode ajustar as velas.",
    "reference": "Provérbio Popular",
    "category": "Motivação",
    "subcategory": "Adaptação",
    "explanation": "Esta metáfora marítima nos ensina sobre adaptabilidade. Não podemos controlar todas as circunstâncias da vida, mas podemos controlar nossa resposta a elas. O poder está em nossa capacidade de ajustar nossa abordagem.",
    "tags": "adaptação, controle, resposta, flexibilidade",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "A verdadeira medida de um homem não é como ele se comporta em momentos de conforto, mas como ele se mantém em tempos de controvérsia.",
    "reference": "Martin Luther King Jr.",
    "category": "Motivação",
    "subcategory": "Caráter",
    "explanation": "O caráter verdadeiro é revelado nas dificuldades. Qualquer pessoa pode ser boa quando tudo está bem, mas nossa integridade é testada quando enfrentamos desafios e pressões.",
    "tags": "caráter, integridade, dificuldades, teste",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "A sabedoria começa com a humildade de reconhecer que não sabemos tudo.",
    "reference": "Sócrates",
    "category": "Sabedoria",
    "subcategory": "Humildade",
    "explanation": "O reconhecimento de nossa ignorância é o primeiro passo para o verdadeiro conhecimento. Quando admitimos que não sabemos tudo, nos tornamos abertos ao aprendizado contínuo.",
    "tags": "sabedoria, humildade, aprendizado, conhecimento",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "Não é o que acontece com você que determina sua felicidade, mas como você reage ao que acontece.",
    "reference": "Epicteto",
    "category": "Sabedoria",
    "subcategory": "Controle Emocional",
    "explanation": "Este princípio estoico nos ensina que nossa felicidade não depende de circunstâncias externas, mas de nossa resposta interna. Temos poder sobre nossos pensamentos e reações, mesmo quando não podemos controlar os eventos.",
    "tags": "felicidade, reação, controle, estoicismo",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "A vida é 10% o que acontece com você e 90% como você reage a isso.",
    "reference": "Charles Swindoll",
    "category": "Sabedoria",
    "subcategory": "Perspectiva",
    "explanation": "Esta frase enfatiza o poder da perspectiva. Embora não possamos controlar todos os eventos, temos controle total sobre nossa atitude e resposta. Nossa perspectiva determina nossa experiência.",
    "tags": "perspectiva, atitude, controle, experiência",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "O tempo é o recurso mais valioso que temos, porque não pode ser recuperado.",
    "reference": "Provérbio Popular",
    "category": "Sabedoria",
    "subcategory": "Valor do Tempo",
    "explanation": "Diferente de outros recursos, o tempo é irreversível. Uma vez perdido, não pode ser recuperado. Isso nos lembra da importância de usar nosso tempo sabiamente e com propósito.",
    "tags": "tempo, valor, recurso, propósito",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "Seja a mudança que você quer ver no mundo.",
    "reference": "Mahatma Gandhi",
    "category": "Inspiração",
    "subcategory": "Liderança Pessoal",
    "explanation": "Em vez de apenas criticar o mundo, devemos começar a mudança em nós mesmos. Quando nos tornamos exemplo do que queremos ver, inspiramos outros a fazer o mesmo.",
    "tags": "mudança, exemplo, liderança, inspiração",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  },
  {
    "text": "A única coisa impossível é aquela que você não tenta.",
    "reference": "Provérbio Popular",
    "category": "Inspiração",
    "subcategory": "Possibilidades",
    "explanation": "Esta frase nos encoraja a sair da zona de conforto. Muitas vezes, limitamos nossas possibilidades por medo ou dúvida. Tentar é o primeiro passo para descobrir o que é realmente possível.",
    "tags": "possibilidades, tentativa, limitações, coragem",
    "isFavorite": false,
    "timesViewed": 0,
    "dateAdded": "1720108800000"
  }
]